---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.SplitSegment(System.Int32)
source: html/586f7208-319a-7101-3e6d-ba01dfcba1c5.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance.SplitSegment Method

Split the panel schedule into
 Thrown if the index is out of bounds.

## Syntax (C#)
```csharp
public bool SplitSegment(
	int iSeg
)
```

## Parameters
- **iSeg** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The iSeg is not a valid segment index.
 -or-